//======================================================
//
//ポーズ画面[game.cpp]
//Author:石原颯馬
//
//======================================================
#include "pause.h"
#include "texture.h"
#include "input.h"
#include "bg.h"
#include "object2D.h"
#include "button2D.h"
#include "fade.h"
#include "sound.h"

//=================================
//コンストラクタ
//=================================
CPause::CPause()
{
	
}

//=================================
//デストラクタ
//=================================
CPause::~CPause()
{
}

//=================================
//初期化
//=================================
HRESULT CPause::Init(void)
{
	return S_OK;
}

//=================================
//終了
//=================================
void CPause::Uninit(void)
{
	
}

//=================================
//更新
//=================================
void CPause::Update(void)
{
	
}

//=================================
//描画
//=================================
void CPause::Draw(void)
{
	//CObjectを親にしているから勝手に描画される
}
